In [ ]:
# In this lab, the objective is to identify the customers who were active in both May and June, and how did their 
# activity differ between months. To achieve this, follow these steps:
    # 1. Establish a connection between Python and the Sakila database.

In [27]:
import pandas as pd
from sqlalchemy import create_engine 
import pymysql.cursors
import os
# import getpass
import urllib.parse ##some sql passwords might have special characters
from sqlalchemy import create_engine, text
import pandas as pd

In [28]:
db ="sakila"

In [29]:
pw_raw = "martino1990" ##this can be changed to os.getenv('') ##this is the SQL password
# Encode the password using urllib.parse.quote_plus()
pw = urllib.parse.quote_plus(pw_raw)
connection_string = 'mysql+pymysql://root:' + pw + '@localhost:3306/'+db
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost:3306/sakila)

In [30]:
connection_string = 'mysql+pymysql://root:' + pw + '@localhost:3306/'+db ##to connect we always need a username, password and address
engine = create_engine(connection_string)
# Establish a connection and execute the query
with engine.connect() as connection:
    query = text('SELECT * FROM actor')
    result = connection.execute(query)
    # Fetch all rows from the query result
    rows = result.fetchall()
    # Create DataFrame from the query result
    df = pd.DataFrame(rows, columns=result.keys())
df

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

In [31]:
# 2.1. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) 
# from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

# engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
# month: an integer representing the month for which rental data is to be retrieved.
# year: an integer representing the year for which rental data is to be retrieved.
# The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table 
# in the Sakila database, and return it as a pandas DataFrame.

def rental_month(engine, month, year):
    with (engine).connect() as connection:
        query = text(f"SELECT * FROM rental WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}")
        result = connection.execute(query)
        rows = result.fetchall()
        df = pd.DataFrame(rows, columns=result.keys())
    return df

rental_month(engine, 5, 2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [32]:
# 2.2. The function should also include the month and year as parameters and use them to name the new column according to the 
# month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

def rental_month(engine, month, year):
    with (engine).connect() as connection:
        query = text(f"SELECT MONTH(rental_date) as Month, YEAR(rental_date) as Year, COUNT(*) AS rentals_{month}_{year} FROM rental WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year} GROUP BY month, year")
        result = connection.execute(query)
        rows = result.fetchall()
        df = pd.DataFrame(rows, columns=result.keys())
    return df

rental_month(engine, 5, 2005)

   Month  Year  rentals_5_2005
0      5  2005            1156

In [72]:
# Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals 
# made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, 
# which is the difference between the number of rentals in the two months.





def compare_rentals(engine, month1, year1, month2, year2):
    with (engine).connect() as connection:
        query = (text(f"SELECT rental.customer_id, MONTH(rental.rental_date) as Month1, YEAR(rental.rental_date) as Year1, MONTH(rental2.rental_date) as Month2, YEAR(rental2.rental_date) as Year2, COUNT(DISTINCT rental.customer_id) AS rentals_{month1}_{year1}, COUNT(DISTINCT rental2.customer_id) AS rentals_{month2}_{year2}, COUNT(DISTINCT rental2.customer_id) - COUNT(DISTINCT rental.customer_id) AS difference FROM rental LEFT JOIN rental AS rental2 on rental.customer_id = rental2.customer_id WHERE MONTH(rental.rental_date) = {month1} AND YEAR(rental.rental_date) = {year1} AND MONTH(rental2.rental_date) = {month2} AND YEAR(rental2.rental_date) = {year2} GROUP BY customer_id, Month1, Year1, Month2, Year2 ORDER BY difference DESC"))
        result = connection.execute(query)
        rows = result.fetchall()
        df = pd.DataFrame(rows, columns=result.keys())
    return df

compare_rentals(engine, "5", 2005, "5", 2005)
#first table as df1, second table as df2, join both tables (inner join or doing window)

,customer_id,Month1,Year1,Month2,Year2,rentals_5_2005,rentals_5_2005,difference
0,1,5,2005,5,2005,1,1,0
1,2,5,2005,5,2005,1,1,0
2,3,5,2005,5,2005,1,1,0
3,5,5,2005,5,2005,1,1,0
4,6,5,2005,5,2005,1,1,0
...,...,...,...,...,...,...,...,...
515,594,5,2005,5,2005,1,1,0
516,595,5,2005,5,2005,1,1,0
517,596,5,2005,5,2005,1,1,0
518,597,5,2005,5,2005,1,1,0
519,599,5,2005,5,2005,1,1,0